const app = getApp()

Page({
  data: {
      winWindow: app.data.windowWidth,
      winHeight: app.data.windowHeight,
      swiperIndex: 0,
      cakes: [
          {
              src: '../../lib/img/cake3.jpg',
              name: '人气蛋糕',
              desc: '彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊'
          },
          {
              src: '../../lib/img/cake2.jpg',
              name: '童趣蛋糕',
              desc: '彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊'
          },
          {
              src: '../../lib/img/cake4.jpg',
              name: '福寿蛋糕',
              desc: '彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊'
          },
          {
              src: '../../lib/img/cake5.jpg',
              name: '情侣蛋糕',
              desc: '彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊'
          },
          {
              src: '../../lib/img/cake1.jpg',
              name: '慕斯蛋糕',
              desc: '彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊彩色的美味，大海般无边的美味都在蔚蓝彩味烘焙坊'
          }
      ]
  },
  onLoad: function () {
      
  },
  swiperChange(e) {
    this.setData({
        swiperIndex: e.detail.current
    })
  },
  toList() {
      wx.navigateTo({
          url: '../detail/detail'
      })
  }
})
